# TextNoteType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNote..::..TextNoteType Property
TextNote Class See Also
---
Access the type of the TextNote object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TextNoteType TextNoteType { get; set; }
```

Visual Basic
---
```text
Public Property TextNoteType As TextNoteType
	Get
	Set
```

Visual C++
---
```text
public:
property TextNoteType^ TextNoteType {
	TextNoteType^ get ();
	void set (TextNoteType^ value);
}
```

# Remarks
The type of the TextNote object can be retrieved or changed.
# See Also
TextNote Class
Autodesk.Revit.DB Namespace